cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

# Development
cask "robo-3t"
brew "clipcopy"
brew "mongodb-database-tools"
brew "mongodb-community@5.0"
# cask "visual-studio-code"
cask "iterm2"
# cask "firefox"
cask "google-chrome"
cask "vlc"
cask "postman"
cask "insomnia"
cask "zoom"
cask "keka"
# cask "obs"
# cask "karabiner-elements"
cask "figma"
cask "alt-tab"
cask "finicky"
cask "bitwarden"
# cask "streamlabs-obs" # OBS with audio?
brew "lua-language-server"

# System
brew "mas"
brew "jq"
cask "smcfancontrol"

# Images, Audio, Video
brew "ffmpeg"

# App Store
mas "Slack", id: 803453959
mas "CopyClip - Clipboard History", id: 595191960
