cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask "visual-studio-code"
cask "iterm2"
cask "firefox"
cask "google-chrome"
cask "vlc"
cask "postman"
cask "zoom"
cask "kitty"
cask "keka"
cask "obs"
# cask "karabiner-elements"
cask "figma"
cask "alt-tab"
cask "finicky"

# System
brew "mas"
brew "jq"
cask "smcfancontrol"

# Images, Audio, Video
brew "ffmpeg"

# App Store
mas "Slack", id: 803453959
mas "CopyClip - Clipboard History", id: 595191960
